{
  "backend/main.mo": "Main Motoko actor defining all core data types (DiscountCode, TaxConfig, SaleOrder, Customer, StaffAccount, AuditLog, etc.) and their CRUD operations, with access control, loyalty points, and audit logging for a POS/restaurant management system.",
  "backend/migration.mo": "Migration module that upgrades existing SaleOrder records by adding a default `paymentType = #cash` field, transforming OldActor state to NewActor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (checkout flow fix, payment mode selection, bill receipt view, print bill, etc.) to their corresponding source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and notable changes such as new hooks, UI features, and routing updates.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, primary, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'Salad Khatora' that mounts the app into a `#root` div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "TanStack Router setup with QueryClientProvider wrapping all app routes (dashboard, inventory, menu, sales, customers, combos, suppliers, etc.) and a theme initializer that reads from localStorage on mount.",
  "frontend/src/components/AddIngredientForm.tsx": "Form component for creating a new ingredient with fields for name, quantity, unit, cost price, low stock threshold, optional supplier selector, and optional expiry date picker, using the `useCreateIngredient` mutation hook.",
  "frontend/src/components/BillReceiptView.tsx": "A dialog component that displays a printable bill receipt after an order is confirmed, showing order details, items, taxes, discounts, payment mode, and customer info with a print button.",
  "frontend/src/components/CheckoutDialog.tsx": "A dialog component for order checkout that displays an order summary with items, totals, and discounts, and lets the user select a payment mode (cash, card, UPI) before confirming.",
  "frontend/src/components/CustomerDetailView.tsx": "A detailed view component for a single customer showing their profile, order history, loyalty points balance, transaction history, and a dialog to redeem loyalty points.",
  "frontend/src/components/EditIngredientForm.tsx": "A form component for editing an existing ingredient's details including name, quantity, unit, cost price, low stock threshold, supplier, and expiry date.",
  "frontend/src/components/Layout.tsx": "The main application layout component providing a responsive sidebar navigation with grouped nav sections, dark mode toggle, unread alert badge, and mobile menu support.",
  "frontend/src/components/ProfileSetupModal.tsx": "An empty file with no content.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDarkMode.ts": "A custom hook that manages dark mode state by persisting the preference to localStorage and toggling the 'dark' class on the document root element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines frontend types, local storage helpers, and React Query hooks for managing ingredients, menu items, combos, suppliers, waste logs, alerts, subscriptions, and backend data.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, custom CSS variables for a white-and-green theme (light/dark), typography, and print styles for bill receipts.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Empty admin settings page component with no content defined.",
  "frontend/src/pages/AlertsPage.tsx": "Displays a list of system alerts (low stock, subscription renewal, expiry warnings) with options to mark individual or all alerts as read.",
  "frontend/src/pages/AuditLogPage.tsx": "Renders a paginated activity log table showing timestamped system actions with actor, action type, target, and details, with color-coded action badges.",
  "frontend/src/pages/CombosPage.tsx": "Displays and manages combo deals with full CRUD operations, allowing users to create/edit combos by selecting menu items, setting a bundle price, and toggling availability.",
  "frontend/src/pages/CustomersPage.tsx": "Manages customer records with search, add, edit, and delete functionality, and supports navigating to a detailed customer view.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a summary dashboard with key stats including total revenue, average order value, total orders, inventory count, and low-stock alerts.",
  "frontend/src/pages/DeliveryCalendarPage.tsx": "Displays upcoming subscription deliveries grouped by date for the next 7 days, showing plan name, items, and renewal date.",
  "frontend/src/pages/DiscountsPage.tsx": "Manages discount codes with support for creating, editing, deleting, and toggling percentage or fixed-amount codes with optional expiry and usage limits.",
  "frontend/src/pages/InventoryPage.tsx": "Manages ingredient inventory with search, add, edit, and delete capabilities, displaying stock levels, cost, supplier, expiry, and low-stock status.",
  "frontend/src/pages/LoginPage.tsx": "Empty or minimal login page file with no visible content provided.",
  "frontend/src/pages/MenuPage.tsx": "Displays and manages restaurant menu items with CRUD operations, availability toggling, and profit margin display using dialogs and cards.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/SalesPage.tsx": "Point-of-sale page for creating orders by adding menu items to a cart, applying discount codes, selecting customers, and completing checkout with a bill receipt.",
  "frontend/src/pages/SalesReportsPage.tsx": "Displays sales performance reports with daily/weekly period toggle, summary stat cards, and a detailed data table.",
  "frontend/src/pages/StaffAccountsPage.tsx": "Manages staff accounts with role-based badges (admin, manager, cashier), supporting create, edit, and delete operations via dialogs.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer meal subscriptions with create, pause, resume, and cancel actions, including menu item selection and frequency configuration.",
  "frontend/src/pages/SuppliersPage.tsx": "React page for managing suppliers with CRUD operations, search filtering, and an auto-generate purchase orders action, using dialogs for add/edit/delete confirmation.",
  "frontend/src/pages/TaxConfigPage.tsx": "React page for managing tax configurations (create, edit, toggle active, delete) with a form dialog supporting name, rate, and applies-to fields.",
  "frontend/src/pages/WasteLogPage.tsx": "React page for logging ingredient waste with reason selection, displaying summary stats (total cost loss, total entries), and a sorted history table.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them to sessionStorage, and clean sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a POS application's known issues (premature cart clearing, missing payment mode), existing features, and pending fix requests for the checkout flow."
}