{
  "backend/main.mo": "Main Motoko actor defining all backend data types (DiscountCode, TaxConfig, SaleOrder, Customer, StaffAccount, AuditLog, etc.) and their in-memory maps with auto-incrementing IDs; includes access control via MixinAuthorization and an audit logging helper.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the 'Actor not available' error on the Add Customer form, listing the affected files (useQueries.ts, CustomersPage.tsx) and associated test/component metadata.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell for the 'Salad Khatora' app that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "TanStack Router configuration that defines all application routes (dashboard, inventory, sales, customers, etc.) under a shared Layout wrapper, with a login route outside the layout and an index redirect to /dashboard.",
  "frontend/src/components/AddIngredientForm.tsx": "React form component for creating a new ingredient with fields for name, quantity, unit, cost, min stock level, optional supplier selection, and optional expiry date, using the useCreateIngredient and useSuppliers hooks.",
  "frontend/src/components/BillReceiptView.tsx": "A dialog component that displays a formatted bill receipt after an order is confirmed, showing items, subtotal, discounts, taxes, payment mode, and a print button.",
  "frontend/src/components/CheckoutDialog.tsx": "A dialog component for confirming an order that displays order items, totals, and allows the user to select a payment method (Cash, Card, or UPI) before confirming.",
  "frontend/src/components/CustomerDetailView.tsx": "A detailed customer profile view showing contact info, loyalty points balance, transaction history, and order history, with a dialog to redeem loyalty points.",
  "frontend/src/components/EditIngredientForm.tsx": "A form component for editing an existing ingredient's details including name, quantity, unit, cost, stock level, supplier, and expiry date.",
  "frontend/src/components/Layout.tsx": "The main application layout component providing a responsive sidebar navigation with grouped nav sections, dark mode toggle, and logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "An empty file with no content.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using the user's Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDarkMode.ts": "A React hook that manages dark mode state by toggling a CSS class on the document root and persisting the preference to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend canister, along with shared TypeScript types for menu items, orders, inventory, staff, and other domain entities.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS layers, defines CSS custom properties for light/dark themes using OKLCH colors, and adds print styles for receipt rendering.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page that displays the current user's role and provides a button for non-admins to claim the admin role via a backend mutation.",
  "frontend/src/pages/AlertsPage.tsx": "Alerts page that lists system notifications with type-based icons and badges, and supports marking individual or all alerts as read.",
  "frontend/src/pages/AuditLogPage.tsx": "Displays a paginated audit log table showing system actions with actor, action type (color-coded), target, and details. Uses the `useAuditLogs` hook and supports loading/empty states.",
  "frontend/src/pages/CombosPage.tsx": "Manages combo deals with CRUD operations and availability toggling, allowing users to bundle menu items with a custom price and calculated savings. Uses dialogs for add/edit and an alert dialog for deletion confirmation.",
  "frontend/src/pages/CustomersPage.tsx": "Provides a customer management interface with search, add, edit, delete, and detail-view functionality. Uses query hooks for CRUD operations and displays inline error messages extracted from backend rejections.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a summary dashboard with stat cards for total revenue, total orders, and average order value, plus a list of the 5 most recent sale orders. Data is fetched via React Query using the actor hook.",
  "frontend/src/pages/DeliveryCalendarPage.tsx": "Shows upcoming subscription deliveries grouped by date within a configurable day range (adjustable in 7-day increments). Filters active subscriptions and maps menu item IDs to names for display.",
  "frontend/src/pages/DiscountsPage.tsx": "Provides a full CRUD UI for managing discount codes, including dialogs for creating/editing codes with fields like type, value, expiry, and max uses, plus toggle active/inactive and delete functionality.",
  "frontend/src/pages/InventoryPage.tsx": "Displays a searchable table of ingredients with stock levels, expiry status, and cost, supporting add, edit, and delete operations via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with an Internet Identity sign-in button, handles authentication state, and redirects to the dashboard upon successful login.",
  "frontend/src/pages/MenuPage.tsx": "Shows a searchable grid of menu items with support for creating, editing, deleting, and toggling availability, using a shared form dialog for add/edit operations.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "Manages purchase orders with a list view showing status badges and expandable details, plus a dialog to create new orders by selecting a supplier and adding ingredient line items.",
  "frontend/src/pages/SalesPage.tsx": "Implements a point-of-sale interface where staff can build an order from menu items, apply discount codes, select a customer, and complete checkout with payment mode selection and bill receipt display.",
  "frontend/src/pages/SalesReportsPage.tsx": "Displays a sales reports page with daily/weekly period toggle, summary cards for total revenue, total orders, and average revenue, and a detailed data table fetched via the useSalesReport hook.",
  "frontend/src/pages/StaffAccountsPage.tsx": "Manages staff accounts with a table listing accounts and dialogs for creating, editing, and deleting staff members, supporting roles (cashier, manager, admin) and active/inactive status.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Provides a subscriptions management page allowing users to create, pause, resume, and cancel customer subscriptions with menu item selection and frequency configuration.",
  "frontend/src/pages/SuppliersPage.tsx": "Implements a suppliers management page with search, and dialogs for adding, editing, and deleting suppliers including form validation and toast notifications.",
  "frontend/src/pages/TaxConfigPage.tsx": "Manages tax configurations with a table of tax entries and dialogs for creating, editing, toggling, and deleting tax configs, supporting rate and appliesTo (all, menu items, combos) fields.",
  "frontend/src/pages/WasteLogPage.tsx": "React page for logging ingredient waste and spoilage, featuring a form to record waste entries (ingredient, quantity, reason) and a table of past logs with stats cards showing total cost loss and entry count.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both query strings and hash-based routing, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch/hsl CSS variables), font families (Poppins, Inter), border radii, box shadows, and accordion keyframe animations, with the animate and typography plugins enabled.",
  "project_state.json": "Project state metadata file tracking version, known issues, and existing/new feature requests; currently focused on fixing an 'Actor not available' error when submitting the Add Customer form."
}