{
  "backend/main.mo": "Main Motoko actor for a restaurant POS backend defining types and state for discount codes, tax configs, sale orders, customers, loyalty transactions, staff accounts, and audit logs, with access control via a mixin authorization module.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their purpose, recent changes, and key implementation details for build planning reference.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app titled 'Salad Khatora' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a QueryClientProvider and defines all application routes (dashboard, sales, inventory, menu, customers, combos, suppliers, purchase orders, subscriptions, delivery calendar, discounts, tax config, staff accounts, waste log, alerts, sales reports, audit log, admin settings) under a shared Layout.",
  "frontend/src/components/AddIngredientForm.tsx": "A form component for creating a new ingredient with fields for name, quantity, unit, cost, min stock level, optional supplier selection, and optional expiry date, using the useCreateIngredient mutation hook.",
  "frontend/src/components/BillReceiptView.tsx": "A dialog component that displays a printable bill receipt showing order details, line items, subtotal, discount, tax breakdown, total, payment mode, customer name, and a print button.",
  "frontend/src/components/CheckoutDialog.tsx": "A modal dialog component for confirming orders that displays cart items, pricing breakdown (subtotal, discounts, taxes), and allows the user to select a payment method (cash, card, or UPI) before confirming.",
  "frontend/src/components/CustomerDetailView.tsx": "A detail view component for a single customer showing their profile info, loyalty points balance, loyalty transaction history, and order history, with a dialog to redeem loyalty points.",
  "frontend/src/components/EditIngredientForm.tsx": "A form component for editing an existing ingredient's details including name, quantity, unit, cost, minimum stock level, supplier, and expiry date, using the updateIngredient mutation.",
  "frontend/src/components/Layout.tsx": "The main application layout component providing a responsive sidebar navigation with grouped nav sections, dark mode toggle, and a mobile hamburger menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "An empty file with no content.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and returns an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDarkMode.ts": "A hook that manages dark mode state by toggling a CSS class on the document root and persisting the preference to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (useQuery/useMutation) for the frontend, along with shared TypeScript types for menu items, combos, suppliers, ingredients, orders, alerts, subscriptions, and more.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, defines CSS custom properties for light/dark themes, and adds a print media query for bill receipts.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page that displays the caller's current role and provides a button to claim the admin role if none has been assigned yet.",
  "frontend/src/pages/AlertsPage.tsx": "Alerts page that lists system notifications (low stock, expiry, order, system) with icons/badges and allows marking individual or all alerts as read.",
  "frontend/src/pages/AuditLogPage.tsx": "Audit log page that displays a paginated table of system activity records including timestamp, actor principal, action, and target details.",
  "frontend/src/pages/CombosPage.tsx": "Combos management page that allows creating, editing, deleting, and toggling availability of combo deals composed of multiple menu items.",
  "frontend/src/pages/CustomersPage.tsx": "Displays a searchable table of customers with dialogs for adding, editing, and deleting customer records using React Query mutation hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a restaurant overview dashboard with stat cards for revenue, orders, average order value, and menu/stock status derived from sales report and inventory data.",
  "frontend/src/pages/DeliveryCalendarPage.tsx": "Renders upcoming subscription deliveries grouped by date within a configurable day range, with navigation controls to expand or shrink the lookahead window.",
  "frontend/src/pages/DiscountsPage.tsx": "Manages discount codes with full CRUD and toggle-active functionality, using dialogs for create/edit forms and mapping between form state and backend DiscountCode types.",
  "frontend/src/pages/InventoryPage.tsx": "Provides a searchable inventory table for ingredients with add, edit, and delete actions, highlighting low-stock and expiring-soon items.",
  "frontend/src/pages/LoginPage.tsx": "Empty or minimal login page file with no visible content provided.",
  "frontend/src/pages/MenuPage.tsx": "Displays and manages restaurant menu items with CRUD operations, availability toggling, and search/filter functionality using React Query hooks and shadcn/ui components.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "Manages purchase orders with creation, status updates, and deletion, allowing users to select suppliers and ingredients with expandable order detail cards.",
  "frontend/src/pages/SalesPage.tsx": "Point-of-sale page for building orders from menu items, applying discount codes, selecting customers, and completing checkout with a bill receipt view.",
  "frontend/src/pages/SalesReportsPage.tsx": "Displays sales analytics with daily/weekly period toggle, showing summary cards for total revenue, orders, and average revenue alongside a detailed report table.",
  "frontend/src/pages/StaffAccountsPage.tsx": "Manages staff accounts with create, edit, and delete operations, supporting role assignment (cashier, manager, admin) and active status toggling via Principal-based identity.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Displays and manages customer subscriptions with a searchable table supporting create, pause, resume, and cancel actions via dialogs. Uses React Query hooks and lets users select menu items to auto-calculate subscription pricing.",
  "frontend/src/pages/SuppliersPage.tsx": "CRUD page for managing suppliers with a searchable table, add/edit dialogs with form validation, and delete confirmation. Uses React Query hooks and shows toast notifications for success/error feedback.",
  "frontend/src/pages/TaxConfigPage.tsx": "Manages tax configurations (create, edit, toggle active, delete) with a table listing tax name, rate, and scope. Includes form validation and error extraction from backend rejection messages.",
  "frontend/src/pages/WasteLogPage.tsx": "Provides a form to log ingredient waste with reason selection and estimated cost loss preview, plus a sorted table of past waste entries and summary stat cards for total cost loss and entry count.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom fonts (DM Sans, Plus Jakarta Sans), OKLCH-based color tokens, border radius, box shadows, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state tracking file (version 3) listing pending audit/fix action requests (AR-1 through AR-10+) covering frontend pages, backend logic, query hooks, and empty components that need to be implemented or removed."
}