{
  "backend/main.mo": "Main Motoko actor implementing discount codes, tax configuration, sale orders, customer management, and loyalty points system with access-control authorization checks on all operations.",
  "feature_evidence.json": "Feature evidence report documenting a single feature fix for AdminSettingsPage.tsx to add a 'Claim Admin' button when the admin role is vacant, with three conditional display states and test ID REQ-69.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component, page, hook, and utility in the project.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point for the 'Salad Khatora' app that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (dashboard, inventory, menu, sales, customers, admin-settings, etc.) wrapped in QueryClientProvider and ThemeProvider.",
  "frontend/src/components/AddIngredientForm.tsx": "Form component for creating a new ingredient with fields for name, quantity, unit, cost price, low stock threshold, optional supplier selector, and optional expiry date picker.",
  "frontend/src/components/CustomerDetailView.tsx": "React component that displays a detailed view of a single customer, including their profile info, subscriptions, order history, and loyalty points with a redeem dialog.",
  "frontend/src/components/EditIngredientForm.tsx": "Form component for editing an existing ingredient's details (name, quantity, unit, cost, supplier, expiry) using the updateIngredient mutation.",
  "frontend/src/components/Layout.tsx": "Main app shell component providing a sticky header, responsive sidebar/nav with all route links, unread alert badge, and logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown on first login to collect the admin user's display name and save it as their profile.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated (or anonymous) ICP backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines TypeScript interfaces/enums for all domain entities (ingredients, menu items, orders, customers, subscriptions, alerts, suppliers, etc.) and exports React Query hooks for fetching and mutating backend data via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for a white-and-green light/dark theme including sidebar, chart, and semantic color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Page for managing the ICP canister admin role, allowing the current admin to reassign or vacate the role and any user to claim a vacant admin role, with principal display and copy functionality.",
  "frontend/src/pages/AlertsPage.tsx": "Displays a list of system alerts (low stock, subscription renewal, expiry warnings) with unread indicators and buttons to mark individual or all alerts as read.",
  "frontend/src/pages/CombosPage.tsx": "CRUD page for combo deals that lets users create, edit, delete, and toggle availability of menu item bundles, showing calculated savings versus individual item prices.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with searchable table, add/edit/delete dialogs, and navigation to a detailed customer view showing loyalty and subscription info.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying summary stats (ingredients, inventory value, low stock, revenue, orders) as cards, with a profile setup modal triggered for new authenticated users.",
  "frontend/src/pages/DeliveryCalendarPage.tsx": "Calendar page showing upcoming subscription deliveries grouped by date, with month navigation and optional customer filter.",
  "frontend/src/pages/DiscountsPage.tsx": "Discount codes management page supporting create, edit, delete, and toggle-active operations via dialogs, with form validation and authentication guard.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page listing ingredients in a searchable table with add, edit, and delete actions, and expiry/low-stock status badges.",
  "frontend/src/pages/LoginPage.tsx": "Login page for Internet Identity authentication that redirects authenticated users to the dashboard and displays branding, a login button, and error state.",
  "frontend/src/pages/MenuPage.tsx": "Displays and manages menu items with CRUD operations, ingredient assignment, availability toggling, and profit margin display. Includes a dialog form for creating/editing items with scheduling (hours and days) and ingredient quantity controls.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "Lists purchase orders in a table with status badges and allows updating order status or auto-generating new orders. Handles pending, received, and cancelled states with appropriate UI controls.",
  "frontend/src/pages/SalesPage.tsx": "Provides a point-of-sale interface for creating new sale orders with menu item selection, promo code application, tax calculation, customer loyalty points, and an order history section. Supports customer association and order notes.",
  "frontend/src/pages/SalesReportsPage.tsx": "Shows daily or weekly sales reports including total orders, revenue, average order value, and top-selling items, with CSV export functionality. Redirects unauthenticated users to the login page.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer meal subscriptions with the ability to create, pause, resume, and cancel subscriptions. Includes a searchable table, a creation dialog with menu item selection and frequency settings, and auto-calculated pricing.",
  "frontend/src/pages/SuppliersPage.tsx": "A full CRUD page for managing suppliers, featuring a searchable table, add/edit dialogs with form validation, delete confirmation, and an auto-generate purchase orders action.",
  "frontend/src/pages/TaxConfigPage.tsx": "A tax configuration management page that allows creating, editing, deleting, and toggling tax configs, plus a live tax preview calculator that shows a breakdown for a sample subtotal.",
  "frontend/src/pages/WasteLogPage.tsx": "A waste and spoilage logging page where users can record ingredient waste with a reason, view aggregate cost-loss stats, and browse a sorted history of waste log entries.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, extended typography/font families, border radii, box shadows, and includes the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Salad Khatora app project at version 21, summarizing completed phases (Sales & Revenue) and the current Phase 4 work (Customer loyalty points, subscription delivery calendar, order history), along with architectural notes and known issues."
}