{
  "backend/main.mo": "Main Motoko actor implementing the full backend API including admin management, user profiles, discount/coupon system, tax configuration, inventory, suppliers, menu, sales, customers, subscriptions, waste logs, and alerts, with role-based access control via MixinAuthorization.",
  "backend/migration.mo": "Defines OldActor and NewActor state types and a `run` migration function to transform persisted canister state between schema versions, covering all major data maps (ingredients, suppliers, orders, menu, sales, customers, subscriptions, waste logs, alerts).",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their titles, affected files, component dependencies, and test IDs, covering discount/coupon pages, tax config, sales reports, and React Query hooks for REQ-42 through REQ-47.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the frontend codebase structure and purpose of each module.",
  "frontend/index.css": "Defines Tailwind base/component/utility layers and OKLCH CSS custom properties for the full light and dark theme color system including background, foreground, primary, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Salad Khatora' that mounts the React app into a `#root` div and loads the TypeScript module entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes (dashboard, inventory, menu, combos, sales, customers, subscriptions, alerts, suppliers, purchase orders, waste log, admin settings) wrapped in QueryClientProvider and ThemeProvider.",
  "frontend/src/components/AddIngredientForm.tsx": "A form component for creating a new ingredient, with validation, supplier selection, and expiry date fields, using a mutation hook to submit to the backend.",
  "frontend/src/components/CustomerDetailView.tsx": "Displays a detailed view of a single customer including contact info and their associated subscriptions, with loading skeletons and a back button.",
  "frontend/src/components/EditIngredientForm.tsx": "A form component for editing an existing ingredient, pre-populated with current values, with validation and an update mutation hook.",
  "frontend/src/components/Layout.tsx": "Main application layout providing a sticky header, responsive desktop/mobile navigation with all route links, unread alert badge, and logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog shown on first login that prompts the user to enter their name and saves it as their admin profile, blocking interaction until submitted.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, admin management, ingredients, menu items, orders, and more.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines light/dark theme CSS custom properties for a white-and-green color scheme.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page allowing the current admin to view, reassign, or vacate the admin role, and allowing any user to claim the role if it is vacant.",
  "frontend/src/pages/AlertsPage.tsx": "Displays a list of system alerts (low stock, subscription renewal, expiry warnings) with options to mark individual or all alerts as read.",
  "frontend/src/pages/CombosPage.tsx": "Page for managing combo deals, supporting create, edit, delete, and availability toggling of combos composed of menu items with bundle pricing.",
  "frontend/src/pages/CustomersPage.tsx": "Displays a searchable, sortable table of customers with CRUD operations (add, edit, delete) via dialogs and an alert dialog for deletion confirmation. Also supports navigating to a detailed customer view via CustomerDetailView component.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a dashboard overview with inventory stats (total ingredients, inventory value, low stock) and sales stats (revenue, today's orders), redirecting unauthenticated users to login and prompting new users with a profile setup modal.",
  "frontend/src/pages/DiscountsPage.tsx": "Manages discount codes with full CRUD and toggle-active functionality, supporting percentage and fixed discount types via a form dialog with validation and delete confirmation.",
  "frontend/src/pages/InventoryPage.tsx": "Provides a searchable, sortable ingredient inventory table with add/edit/delete dialogs, expiry date tracking, low-stock indicators, and supplier association.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login page for the Salad Khatora app, redirecting authenticated users to the dashboard and showing loading/error states during the login flow.",
  "frontend/src/pages/MenuPage.tsx": "Provides a full CRUD UI for managing restaurant menu items, including forms for ingredients, scheduling (days/hours), availability toggling, and per-item profit margin badges.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "Displays a table of purchase orders with status badges and allows updating each order's status (pending/received/cancelled) via a dropdown select.",
  "frontend/src/pages/SalesPage.tsx": "Implements a point-of-sale interface for creating new sale orders with item quantity controls, promo code application, tax calculation, and a history of past sale orders.",
  "frontend/src/pages/SalesReportsPage.tsx": "Shows daily or weekly sales reports with revenue summaries and top-selling items, and supports CSV export of the report data.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer meal subscriptions with a searchable table, status badges, and a dialog form to create subscriptions with menu item selection, frequency, and auto-calculated pricing.",
  "frontend/src/pages/SuppliersPage.tsx": "React page for managing suppliers with full CRUD operations, search filtering, and an auto-generate purchase orders action, using dialogs for add/edit and an alert dialog for deletion confirmation.",
  "frontend/src/pages/TaxConfigPage.tsx": "React page for managing tax configurations (create, edit, delete, toggle active) with a live tax preview calculator that applies configured rates to a sample subtotal.",
  "frontend/src/pages/WasteLogPage.tsx": "React page for logging ingredient waste with a form (ingredient, quantity, reason), summary stat cards for total cost loss and entry count, and a sorted table of past waste log entries.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography/container-query/animate plugins, custom font families, border radii, and box shadows.",
  "project_state.json": "Tracks the current state of the Salad Khatora app project at version 15, documenting existing features, architectural notes, known issues, and the next planned phase (Sales & Revenue: Discounts, Reports, Tax Config)."
}