{
  "backend/main.mo": "Main Motoko actor implementing user profile management and inventory CRUD operations with role-based access control (admin/user permissions) using AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (login screen, inventory management, dashboard, theming/navigation) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a quick reference for the purpose of each file in the frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, sidebar, and chart color tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Salad Khatora' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root, login (unprotected), and protected routes (dashboard, inventory) with a shared Layout wrapper and an index redirect to /dashboard.",
  "frontend/src/components/AddIngredientForm.tsx": "Form component for adding a new inventory ingredient with field validation, real-time total value preview, loading/success states, and mutation via useAddInventoryItem hook.",
  "frontend/src/components/EditIngredientForm.tsx": "Pre-populated form component for editing an existing inventory ingredient, supporting validation, total value preview, and update mutation with success/cancel callbacks.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, logo, desktop/mobile navigation links (Dashboard, Inventory), and a logout button using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves it as their admin profile using the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and context provider that manages Internet Identity authentication state, exposing login, logout, and identity status via a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend interactions including user profile CRUD, inventory CRUD, dashboard stats, and low-stock item queries.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines a white-and-green light/dark theme using CSS custom properties.",
  "frontend/src/lib/utils.ts": "Utility module exporting a single `cn` helper that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying inventory stats (total items, value, low stock) and a low-stock items list, with a profile setup modal trigger for new users.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page that lists, searches, sorts, adds, edits, and deletes kitchen ingredient items with low-stock highlighting.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirecting to the dashboard on success and showing loading/error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Salad Khatora app project (version 3), including existing features (admin login, inventory management, dashboard, UI theme) and architectural notes about the white/green theme and mobile-friendliness."
}