{
  "backend/main.mo": "Main Motoko actor implementing the backend for a POS/restaurant system, including discount codes, tax configs, sale orders, customers, loyalty transactions, staff accounts, and audit logging with role-based access control.",
  "feature_evidence.json": "Feature evidence report linking the ProfileSetupModal fix (preventing freeze on 'Get Started' submission) to specific files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing their purpose and notable changes such as new hooks, UI fixes, and component refactors.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point for the 'Salad Khatora' app, mounting the React app at the #root div and loading the main TSX module.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes under a protected layout that checks Internet Identity authentication, wrapped in a QueryClientProvider.",
  "frontend/src/components/AddIngredientForm.tsx": "Form component for adding a new ingredient with fields for name, quantity, unit, cost price, low stock threshold, optional supplier, and expiry date, using the useCreateIngredient mutation hook.",
  "frontend/src/components/CustomerDetailView.tsx": "React component that displays a detailed customer profile including order history, loyalty points balance, loyalty transactions, and a form to redeem loyalty points for discounts.",
  "frontend/src/components/EditIngredientForm.tsx": "Form component for editing an existing ingredient's details (name, quantity, unit, cost price, low stock threshold, supplier, expiry date) using the updateIngredient mutation.",
  "frontend/src/components/Layout.tsx": "Main application layout component providing a responsive sidebar navigation with links to all app sections, dark mode toggle, unread alert badge, and logout functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name to create a profile on first login, blocking interaction until saved.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useDarkMode.ts": "Custom hook that persists and toggles dark mode by managing the 'dark' class on the document root and storing the preference in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend canister, along with local TypeScript interfaces and enums for entities like Ingredient, Supplier, MenuItem, ComboDeal, PurchaseOrder, WasteLog, Alert, and Subscription.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for a white-and-green light/dark theme including sidebar, chart, and semantic color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page allowing the current admin to view their status, reassign the admin role to another principal, vacate the role, or claim it if vacant.",
  "frontend/src/pages/AlertsPage.tsx": "Displays a list of system alerts (low stock, expiry warnings, subscription renewals) with options to mark individual alerts or all alerts as read.",
  "frontend/src/pages/AuditLogPage.tsx": "Admin-only page that shows a paginated table of audit log entries with action badges, truncated principals, and a load-more mechanism.",
  "frontend/src/pages/CombosPage.tsx": "CRUD page for combo deals that lets users create, edit, delete, and toggle availability of menu item bundles, with live savings preview.",
  "frontend/src/pages/CustomersPage.tsx": "Displays a searchable table of customers with add, edit, and delete dialogs, and navigates to a CustomerDetailView when a customer row is selected.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a summary dashboard with revenue, order, inventory, and low-stock stat cards, and triggers a profile setup modal for newly authenticated users.",
  "frontend/src/pages/DeliveryCalendarPage.tsx": "Renders upcoming subscription deliveries grouped by date in a calendar-style layout, showing plan name, items, and renewal date for each delivery.",
  "frontend/src/pages/DiscountsPage.tsx": "Manages discount codes with a table listing all codes and dialogs for creating, editing, toggling, and deleting them; redirects unauthenticated users to the dashboard.",
  "frontend/src/pages/InventoryPage.tsx": "Displays a searchable ingredient inventory table with add, edit, and delete actions, highlighting low-stock and expiring-soon items with badges.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login page for the Salad Khatora app, redirecting already-authenticated users to the dashboard and showing loading/error states during login.",
  "frontend/src/pages/MenuPage.tsx": "React page for managing menu items, supporting create, edit, delete, and availability toggle operations via query hooks, with dialogs for forms and confirmation.",
  "frontend/src/pages/PurchaseOrdersPage.tsx": "React page that displays purchase orders in a table, allows status updates (pending/received/cancelled), and supports auto-generating orders via a button.",
  "frontend/src/pages/SalesPage.tsx": "React POS page for building sale orders by adding menu items to a cart, applying promo codes, selecting customers with loyalty points, computing taxes, and submitting orders.",
  "frontend/src/pages/SalesReportsPage.tsx": "React page that displays daily or weekly sales reports with summary cards for total revenue, total orders, and average revenue, plus a detailed data table.",
  "frontend/src/pages/StaffAccountsPage.tsx": "Admin-only React page for managing staff accounts, supporting create, edit (name/role/active status), and delete operations with role-based badges and access control redirect.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page for managing customer subscriptions, supporting create, pause, resume, and cancel operations with a searchable table and dialog forms.",
  "frontend/src/pages/SuppliersPage.tsx": "React page for managing suppliers with CRUD operations, form validation, and an auto-generate purchase orders action.",
  "frontend/src/pages/TaxConfigPage.tsx": "React page for managing tax configurations (create, edit, toggle, delete), restricted to authenticated users and redirecting unauthenticated ones to the dashboard.",
  "frontend/src/pages/WasteLogPage.tsx": "React page for logging ingredient waste with a form for recording entries and stat cards showing total cost loss and entry count.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (DM Sans, Plus Jakarta Sans), OKLCH-based color tokens, border radii, box shadows, and enabling dark mode via class. Includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 29) for the Salad Khatora app, documenting completed features through Phase 4, current Phase 5 goals (role-based staff accounts, audit log, dark mode), known issues, and architectural notes."
}