{
  "kind": "build_request",
  "title": "Fix checkout flow: bill generation, print option, and payment mode selection",
  "projectName": "Salad Khatora POS",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the checkout flow in SalesPage.tsx so that pressing the Checkout button does NOT clear the cart prematurely. Instead, it should open a checkout/order summary dialog that displays all added items, quantities, and prices before completing the sale.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "after adding the the item then pressed checkout showing processing and it is getting cleared showimg no item added"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Checkout opens a modal/dialog showing all cart items with name, quantity, and price",
        "Cart items remain visible inside the checkout dialog and are not cleared during processing",
        "The checkout dialog is dismissible and returns the user to the cart without data loss"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a payment mode selection step inside the checkout dialog. The user must be able to choose a payment method (e.g., Cash, Card, UPI/Online) before confirming the order. The selected payment mode must be recorded with the sale order.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "not showing payment mode"
        ]
      },
      "acceptanceCriteria": [
        "Checkout dialog includes a clearly labeled 'Payment Mode' section with selectable options: Cash, Card, and UPI/Online",
        "User cannot confirm/complete the order without selecting a payment mode",
        "Selected payment mode is passed to the backend and stored with the sale order record"
      ]
    },
    {
      "id": "REQ-3",
      "text": "After the user selects a payment mode and confirms the order, generate a bill/receipt view inside the checkout dialog (or a follow-up dialog) that displays: order ID, date/time, list of items with quantities and prices, subtotal, taxes, discounts, and total amount due, along with the selected payment mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it should generate bill and print option"
        ]
      },
      "acceptanceCriteria": [
        "Bill view shows order ID, date and time, itemized list with quantities and unit prices, applied discount (if any), tax breakdown, and grand total",
        "Bill view shows the payment mode used",
        "Bill is displayed after order confirmation succeeds on the backend"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a 'Print Bill' button on the generated bill view that triggers the browser's print dialog scoped to the bill content only, hiding all navigation and UI chrome during print.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "generate bill and print option"
        ]
      },
      "acceptanceCriteria": [
        "A 'Print Bill' button is visible on the bill receipt view",
        "Clicking Print Bill opens the browser print dialog",
        "Only the bill content is printed; sidebar, navigation, and other UI elements are hidden via print CSS",
        "The printed receipt is cleanly formatted and readable"
      ]
    },
    {
      "id": "REQ-5",
      "text": "After the bill is displayed and the user dismisses the bill dialog, clear the cart and reset the POS state (selected customer, discount code) ready for the next transaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "after adding the the item then pressed checkout"
        ]
      },
      "acceptanceCriteria": [
        "Cart is cleared only after successful order confirmation and the bill dialog is closed or a 'New Sale' button is clicked",
        "Customer selection and discount code fields are reset after cart is cleared",
        "POS page is in a clean state ready for a new transaction after dismissal"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths",
    "All Motoko changes must remain within the single backend/main.mo actor",
    "Cart must not be cleared before the order is successfully confirmed by the backend"
  ],
  "nonGoals": [
    "Redesigning the overall POS layout or navigation",
    "Adding new payment gateway integrations",
    "Email or SMS receipt delivery",
    "Multi-currency support"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}