{
  "kind": "build_request",
  "title": "Fix Profile Setup Modal freezing after entering name",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-86",
      "text": "Fix the Profile Setup Modal in `frontend/src/components/ProfileSetupModal.tsx` so that clicking 'Get Started' after entering a name does not freeze or get stuck. Investigate and resolve the issue causing the modal to hang on submission — likely the `createUserProfile` (or equivalent) mutation call is not resolving or the loading state is never cleared. Ensure: (1) the 'Get Started' button shows a loading spinner while the mutation is in-flight; (2) on success the modal closes and the user proceeds normally; (3) on error a visible error message is displayed and the button becomes re-clickable; (4) the button is disabled only while the mutation is actively pending, never indefinitely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "after entering the name it is getting struck"
        ]
      },
      "acceptanceCriteria": [
        "Typing a name in the 'Your Name' field and clicking 'Get Started' does not cause the modal to freeze indefinitely.",
        "The 'Get Started' button displays a loading indicator while the profile save is in progress.",
        "On a successful save the modal closes automatically and the dashboard is visible.",
        "On a backend error an error message is shown inside the modal and the button becomes clickable again.",
        "The button is never left permanently disabled after a submission attempt."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui).",
    "Do not change the backend profile storage logic unless the root cause is a backend bug."
  ],
  "nonGoals": [
    "Redesigning the Profile Setup Modal UI beyond fixing the freeze bug.",
    "Adding new profile fields.",
    "Changes to any other page or component unrelated to the modal freeze."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}