{
  "kind": "build_request",
  "title": "Fix Admin Settings page to show Claim Admin button when admin role is vacant",
  "projectName": "Salad Khatora",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-69",
      "text": "Fix the Admin Settings page (`frontend/src/pages/AdminSettingsPage.tsx`) so that when the current user does not have admin access AND the admin role is vacant (i.e., `getAdminPrincipal` returns an empty/null principal or `claimAdminIfVacant` would succeed), the page displays a 'Claim Admin' button that calls `useClaimAdminIfVacant`. Currently the page only shows 'You do not have admin access' without offering the claim option. The logic should be: (1) if the user IS the admin — show the full admin panel (reassign, vacate); (2) if the user is NOT the admin but the admin role IS vacant — show the 'Claim Admin (if vacant)' button with explanatory text; (3) if the user is NOT the admin and an admin IS already assigned — show the 'You do not have admin access' message only. Show success or error feedback after the claim attempt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "showing you dont have admin access before it had option to claim admin access"
        ]
      },
      "acceptanceCriteria": [
        "When the admin role is vacant, a logged-in non-admin user sees a 'Claim Admin' button on the Admin Settings page instead of (or in addition to) the 'You do not have admin access' message.",
        "Clicking 'Claim Admin' calls `useClaimAdminIfVacant` and shows a success toast on completion or an error message on failure.",
        "When the admin role is already assigned to another principal, the page shows only the 'You do not have admin access' message with no claim button.",
        "When the logged-in user IS the admin, the full admin panel (reassign, vacate) is displayed as before.",
        "The vacant-admin detection logic uses the value returned by `useAdminPrincipal` — if it is empty, null, or an empty string, the role is considered vacant."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths.",
    "Do not alter backend logic — the fix is purely in the frontend AdminSettingsPage component."
  ],
  "nonGoals": [
    "Adding new backend endpoints or changing admin role logic in the Motoko actor.",
    "Changing the visual theme or layout of the Admin Settings page beyond the required conditional UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}