{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin Settings page to show Claim Admin button when admin role is vacant",
  "requirements": [
    {
      "id": "REQ-69",
      "summary": "Add conditional UI logic to AdminSettingsPage to display a 'Claim Admin' button when the admin role is vacant, allowing non-admin users to claim the role. Show different UI states based on whether the user is admin, the role is vacant, or an admin is already assigned.",
      "acceptanceCriteria": [
        "When the admin role is vacant, a logged-in non-admin user sees a 'Claim Admin' button on the Admin Settings page instead of (or in addition to) the 'You do not have admin access' message.",
        "Clicking 'Claim Admin' calls `useClaimAdminIfVacant` and shows a success toast on completion or an error message on failure.",
        "When the admin role is already assigned to another principal, the page shows only the 'You do not have admin access' message with no claim button.",
        "When the logged-in user IS the admin, the full admin panel (reassign, vacate) is displayed as before.",
        "The vacant-admin detection logic uses the value returned by `useAdminPrincipal` — if it is empty, null, or an empty string, the role is considered vacant."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSettingsPage.tsx",
          "operation": "modify",
          "description": "Update the AdminSettingsPage component to add conditional rendering logic that detects when the admin role is vacant (by checking if the adminPrincipal from useAdminPrincipal is empty, null, or an empty string). Add a new UI section that displays when the current user is not admin AND the role is vacant, containing a 'Claim Admin' button that calls the useClaimAdminIfVacant mutation hook. Include explanatory text describing what claiming the admin role means. Show success/error toast messages after the claim attempt using the existing toast system. Ensure the three UI states are clearly separated: (1) user is admin → show full admin panel with reassign/vacate controls, (2) user is not admin but role is vacant → show 'Claim Admin' button with explanation, (3) user is not admin and role is occupied → show 'You do not have admin access' message only."
        }
      ]
    }
  ]
}