{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 'Actor not available' error when adding a customer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the 'Actor not available' error that occurs when submitting the Add Customer form by ensuring the backend actor is fully initialized before the create customer mutation is invoked, adding proper loading/guard states, and displaying user-friendly error messages.",
      "acceptanceCriteria": [
        "Opening the Add Customer dialog and submitting the form does not produce an 'Actor not available' error.",
        "The Add Customer submit button is disabled while the actor is still initializing.",
        "If the actor fails to initialize, a descriptive error message is shown to the user.",
        "Successfully adding a customer updates the customer list without page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useCreateCustomer mutation hook to properly handle actor availability by adding enabled/ready state checking based on the useActor hook's isFetching state. Ensure the mutation function checks for actor availability before attempting to call actor.addCustomer and throws a descriptive error if the actor is null or unavailable."
        },
        {
          "path": "frontend/src/pages/CustomersPage.tsx",
          "operation": "modify",
          "description": "Add actor readiness checking to the Add Customer form by integrating the isFetching state from useActor. Disable the submit button when the actor is still initializing (actorFetching is true) or when the mutation is pending. Display a loading indicator or disabled state message on the submit button to inform users that the system is initializing. Add error handling to display user-friendly error messages if actor initialization fails or if the mutation throws an 'Actor not available' error, ensuring the error is shown in the UI rather than crashing silently."
        }
      ]
    }
  ]
}