{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix checkout flow: bill generation, print option, and payment mode selection",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent cart from clearing prematurely during checkout; show order summary dialog with all items before completing sale",
      "acceptanceCriteria": [
        "Clicking Checkout opens a modal/dialog showing all cart items with name, quantity, and price",
        "Cart items remain visible inside the checkout dialog and are not cleared during processing",
        "The checkout dialog is dismissible and returns the user to the cart without data loss"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Refactor the checkout flow to open a dialog instead of immediately processing the order. Move the cart-clearing logic so it only executes after successful order confirmation. Add state management for a checkout dialog that displays all cart items with their names, quantities, and prices. Ensure the dialog can be dismissed without losing cart data."
        },
        {
          "path": "frontend/src/components/CheckoutDialog.tsx",
          "operation": "create",
          "description": "Create a new dialog component that displays the order summary before confirmation. Show cart items in a table with columns for item name, quantity, unit price, and line total. Include subtotal, discount amount (if any), tax breakdown, and grand total. Provide 'Cancel' and 'Confirm Order' buttons. Accept props for cart items, discount info, tax info, customer, and callbacks for confirm/cancel actions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add payment mode selection step inside checkout dialog before order confirmation",
      "acceptanceCriteria": [
        "Checkout dialog includes a clearly labeled 'Payment Mode' section with selectable options: Cash, Card, and UPI/Online",
        "User cannot confirm/complete the order without selecting a payment mode",
        "Selected payment mode is passed to the backend and stored with the sale order record"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CheckoutDialog.tsx",
          "operation": "modify",
          "description": "Add a 'Payment Mode' selection section to the CheckoutDialog with radio buttons or a select dropdown for Cash, Card, and UPI/Online options. Add validation to disable the 'Confirm Order' button until a payment mode is selected. Store the selected payment mode in component state and pass it to the confirm callback. Map the selected option to the backend PaymentMode type (cash, card, upi, or other)."
        },
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Update the checkout handler to accept the selected payment mode from the CheckoutDialog. Pass the payment mode to the createSaleOrder mutation when confirming the order. Ensure the paymentType parameter matches the backend interface's PaymentMode enum structure."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Generate and display a bill/receipt view after successful order confirmation showing order details, items, pricing, taxes, and payment mode",
      "acceptanceCriteria": [
        "Bill view shows order ID, date and time, itemized list with quantities and unit prices, applied discount (if any), tax breakdown, and grand total",
        "Bill view shows the payment mode used",
        "Bill is displayed after order confirmation succeeds on the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BillReceiptView.tsx",
          "operation": "create",
          "description": "Create a new component that renders a formatted bill/receipt. Display the order ID, date/time formatted for readability, customer name (if selected), itemized list of products with quantities and unit prices, subtotal, discount details (code and amount if applied), tax breakdown showing each tax line item, grand total, and payment mode. Use a clean, print-friendly layout with clear section headers and appropriate typography. Accept props for the confirmed order data returned from the backend."
        },
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Add state management for showing the bill view after successful order creation. When the createSaleOrder mutation succeeds, fetch the created order details (or use the returned order ID to retrieve full data) and transition from the checkout dialog to the bill receipt view. Pass the complete order data including items, totals, tax breakdown, discount info, customer, and payment mode to the BillReceiptView component."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a 'Print Bill' button that triggers the browser print dialog for the bill content only",
      "acceptanceCriteria": [
        "A 'Print Bill' button is visible on the bill receipt view",
        "Clicking Print Bill opens the browser print dialog",
        "Only the bill content is printed; sidebar, navigation, and other UI elements are hidden via print CSS",
        "The printed receipt is cleanly formatted and readable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BillReceiptView.tsx",
          "operation": "modify",
          "description": "Add a 'Print Bill' button to the BillReceiptView component that calls window.print() when clicked. Wrap the bill content in a container with a print-specific class or ID. Add inline or scoped print media query styles that hide all non-bill UI elements (buttons, navigation, sidebar) and ensure the bill layout is optimized for printing (white background, black text, proper margins)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add print media query CSS rules to hide the application layout, sidebar, and navigation during print. Use @media print to target only the bill receipt container for printing. Ensure proper page breaks, margins, and typography for printed receipts. Set background colors to white and text to black for print clarity."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Clear cart and reset POS state only after bill is displayed and dismissed by the user",
      "acceptanceCriteria": [
        "Cart is cleared only after successful order confirmation and the bill dialog is closed or a 'New Sale' button is clicked",
        "Customer selection and discount code fields are reset after cart is cleared",
        "POS page is in a clean state ready for a new transaction after dismissal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BillReceiptView.tsx",
          "operation": "modify",
          "description": "Add a 'Close' or 'New Sale' button to the BillReceiptView that triggers a callback when clicked. This callback will be provided by the parent SalesPage to handle cleanup after the bill is dismissed."
        },
        {
          "path": "frontend/src/pages/SalesPage.tsx",
          "operation": "modify",
          "description": "Implement a cleanup handler that clears the cart state, resets the selected customer, clears the applied discount code, and closes the bill view dialog when the user dismisses the bill. Ensure this cleanup only happens after the order is successfully created and the bill has been displayed. Do not clear cart state during checkout processing or if the order creation fails. Reset all POS form fields to their initial empty state."
        }
      ]
    }
  ]
}