{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Profile Setup Modal Freeze Bug",
  "requirements": [
    {
      "id": "REQ-86",
      "summary": "Fix ProfileSetupModal freezing after entering name by ensuring the mutation resolves properly, loading states are managed correctly, and error handling allows retry",
      "acceptanceCriteria": [
        "Typing a name in the 'Your Name' field and clicking 'Get Started' does not cause the modal to freeze indefinitely.",
        "The 'Get Started' button displays a loading indicator while the profile save is in progress.",
        "On a successful save the modal closes automatically and the dashboard is visible.",
        "On a backend error an error message is shown inside the modal and the button becomes clickable again.",
        "The button is never left permanently disabled after a submission attempt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Fix the ProfileSetupModal component to properly handle the saveCallerUserProfile mutation lifecycle. Ensure: (1) the button is disabled only while isPending is true from the useSaveCallerUserProfile mutation hook; (2) display a loading spinner on the button during submission using isPending state; (3) on mutation success, invalidate the 'currentUserProfile' query key to trigger a refetch and close the modal automatically; (4) on mutation error, display the error message inside the modal using error.message from the mutation hook and keep the button enabled for retry; (5) prevent form submission if the name field is empty; (6) ensure onOpenChange is not blocked and the modal can be dismissed after save completes. Review the current implementation to identify if the mutation's onSuccess callback is missing query invalidation or if error states are not being displayed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useSaveCallerUserProfile mutation hook to ensure it returns proper isPending, isError, and error states. Verify the mutation function correctly calls actor.saveCallerUserProfile with a UserProfile object (not just a string). Ensure the onSuccess callback invalidates the 'currentUserProfile' query key using queryClient.invalidateQueries. Add proper error handling to surface backend errors to the UI. If the hook does not exist, create it following the pattern of other mutation hooks in this file, wrapping the backend's saveCallerUserProfile method."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Review the DashboardPage to ensure the showProfileSetup condition correctly uses isAuthenticated, !profileLoading, isFetched, and userProfile === null as per the authorization component usage instructions. Verify that the ProfileSetupModal is rendered with proper state management and that after a successful profile save, the modal closes and the dashboard content is shown without requiring a page refresh. Ensure the query refetch logic properly updates the userProfile state when the modal completes."
        }
      ]
    }
  ]
}